def gcd(a:int, b:int) -> int:
  # НОД(f1, f2) = НОД(f2, f1 % f2) 
  
  # Если f2 = 0, то НОД(f1, f2) = НОД(f1, 0) = f1.
  # Если f2 = 1, то НОД(f1, f2) = НОД(f2, 1) = НОД(1, 0) = 1. НОД(f1, f2) не существует.

  # НОД(13, 10) = НОД(10, 3) = НОД(3, 1) = НОД(1, 0) = 1. НОД(13, 10) не существует.
  # НОД(10, 13) = НОД(13, 10) = НОД(10, 3) = ...
  # НОД(25, 15) = НОД(15, 10) = НОД(10, 5) = НОД(5, 0) = 5.
  # НОД(15, 25) = НОД(25, 15) = НОД(15, 10) = ...
  
  while b != 0:
    a, b = b, a % b
    
  return a


def gcd_r(a:int, b:int) -> int:
  if b == 0: 
    return a
  
  return gcd_r(b, a % b)
